Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/air_travel/compensation_for_overbooked_and_delayed_flights.html.txt.tmx
Source language: en
Languages: ga

source: If you have a complaint about the assistance and compensation you have received for denied boarding or cancelled or delayed flights, you must begin by contacting your airline directly
ga: Má bhíonn gearán agat faoin gcúnamh agus faoin gcúiteamh a fuair tú de bharr gur diúltaíodh duit bordáil, nó mar gheall ar eitiltí ar ar cuireadh ceal nó moill, is é an chéad bheart is ceart duit a dhéanamh dul i dteagmháil le d'aerlíne go díreach

source: If you believe your entitlement to compensation/assistance has not been met, you should then make a complaint to the appropriate national enforcement body
ga: Má mheasann tú nár freastalaíodh ar do theidlíocht i leith cúitimh/cúnaimh, ba cheart duit gearán a dhéanamh leis an gcomhlacht cuí forfheidhmithe náisiúnta

source: Each member state is responsible for departures from airports within its territory and arrivals into such airports from third countries on EU/EEA-licensed carriers
ga: Tá gach ballstát freagrach as imeachtaí ó aerfoirt laistigh dá bhfearann féin agus as teacht isteach go dtí na haerfoirt sin ó thríú tíortha ar iompróirí ag a bhfuil ceadúnas ón gComhphobal

source: If you have a complaint about a flight returning to Ireland from the EU/EEA, you contact the national enforcement body in the EU/EEA state your flight departed from
ga: Má bhíonn gearán agat faoi eitilt a fhilleann ar Éirinn ón AE/LEE, déanann tú teagmháil leis an gcomhlacht forfheidhmithe náisiúnta sa stát den AE/LEE inar fhág d’eitilt

source: The Commission for Aviation Regulation is the national enforcement body in Ireland
ga: Is iad an Coimisiún um Rialáil Eitlíochta an comhlacht forfheidhmithe náisiúnta in Éirinn

source: It deals with complaints arising from flights departing from Irish airports or those arriving at an Irish airport from outside the EU/EEA on an EUEEA-licensed carrier
ga: Déileálann sé le gearáin a eascraíonn as eitiltí ag imeacht ó aerfoirt na hÉireann nó ó eitiltí teacht ar aerfort Éireannach ó lasmuigh den AE/LEE ar iompróir AE/LEE-ceadúnaithe

source: Information on how to make a complaint to the Regulator is available on its website
ga: Tá faisnéis ar conas gearán a dhéanamh leis an Rialtóir ar fáil ar a láithreán gréasáin

source: It also has information on your rights on flightrights.ie
ga: Ina theannta sin, tá ann faisnéis ar do chearta ar flightrights.ie
